Revit 2027 API
ConceptualConstructionType.IsValidConceptualConstructionIdForCategory Method
 Indicate if a ConceptualConstruction is appropriate to assign to a MassSurfaceData of a particular Mass subcategory.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidConceptualConstructionIdForCategory(
	Document ccda,
	ElementId constructionTypeId,
	ElementId massSubcategoryId
)
Public Shared Function IsValidConceptualConstructionIdForCategory (
	ccda As Document,
	constructionTypeId As ElementId,
	massSubcategoryId As ElementId
) As Boolean
public:
static bool IsValidConceptualConstructionIdForCategory(
	Document^ ccda,
	ElementId^ constructionTypeId,
	ElementId^ massSubcategoryId
)
static member IsValidConceptualConstructionIdForCategory :
        ccda : Document *
        constructionTypeId : ElementId *
        massSubcategoryId : ElementId -> bool
Parameters
ccda Document
 The document.
constructionTypeId ElementId
 The ElementId of the ConceptualConstructionType.
massSubcategoryId ElementId
 The ElementId of the Mass subcategory.
Return Value
Boolean
 Returns true if valid, false otherwise
Exceptions
Exception | Condition
ArgumentException |  The ElementId constructionTypeId is not an id of a ConceptualConstructionType. -or- The mass sub-category is none of the OST_MassInteriorWall, OST_MassExteriorWall, OST_MassExteriorWallUnderground, OST_MassWallsAll, OST_MassRoof, OST_MassFloor, OST_MassSlab, OST_MassFloorsAll, OST_MassShade, OST_MassGlazing, OST_MassSkylights, OST_MassGlazingAll or OST_MassOpening.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace